#ifndef __DATASYNC_H__
#define __DATASYNC_H__

#include "../../SexyAppFramework/Common.h"

class DataReader
{
protected:
	FILE*					mFile;			//+0x4
	char*					mData;			//+0x8
	uint32_t			mDataLen;		//+0xC
	uint32_t			mDataPos;		//+0x10
	bool					mOwnData;		//+0x14

public:
	DataReader();
	virtual ~DataReader();

	bool					OpenFile(const std::string& theFileName);
	void					OpenMemory(const void* theData, uint32_t theDataLen, bool takeOwnership);
	void					Close();
	void					ReadBytes(void* theMem, uint32_t theNumBytes);
	void					Rewind(uint32_t theNumBytes);
	uint32_t				ReadUInt32();
	uint16_t				ReadUInt16();
	uint8_t					ReadUInt8();
	bool					ReadBool();
	float					ReadFloat();
	double					ReadDouble();
	void					ReadString(std::string& theStr);
};
class DataReaderException : public std::exception
{
};

class DataWriter
{
protected:
	FILE*					mFile;			//+0x4
	char*					mData;			//+0x8
	uint32_t				mDataLen;		//+0xC
	uint32_t				mCapacity;		//+0x10

protected:
	void					EnsureCapacity(uint32_t theNumBytes);

public:
	DataWriter();
	virtual ~DataWriter();

	bool					OpenFile(const std::string& theFileName);
	void					OpenMemory(uint32_t theReserveAmount = 0x20);
	void					Close();
	inline bool				WriteToFile(const std::string& theFileName);
	void					WriteBytes(const void* theData, uint32_t theDataLen);
	void					WriteUInt32(uint32_t theUInt32);
	void					WriteUInt16(uint16_t theUInt16);
	void					WriteUInt8(uint8_t theUInt8);
	void					WriteBool(bool theBool);
	void					WriteFloat(float theFloat);
	void					WriteDouble(double theDouble);
	void					WriteString(const std::string& theStr);
	inline uint32_t	GetPos();
	inline void				SetUInt32(uint32_t, uint32_t) { /* 未找到 */ }
	inline void				SetUInt16(uint32_t, uint32_t) { /* 未找到 */ }
	inline void				SetUInt8(uint32_t, uint32_t) { /* 未找到 */ }
	inline void*			GetDataPtr() { return mData; }
	inline int				GetDataLen() { return mDataLen; }
};

typedef std::map<void*, int> PointerToIntMap;
typedef std::map<int, void*> IntToPointerMap;

class DataSync
{
protected:
	DataReader*				mReader;
	DataWriter*				mWriter;
	int						mVersion;
	PointerToIntMap			mPointerToIntMap;
	IntToPointerMap			mIntToPointerMap;
	std::vector<void**>		mPointerSyncList;
	int						mCurPointerIndex;

protected:
	void ResetPointerTable();
	void Reset();

public:
	DataSync(DataReader& theReader);
	DataSync(DataWriter& theWriter);
	virtual ~DataSync();

	inline void				SyncPointers() { /* 未找到 */ }
	inline void				SetReader(DataReader* theReader) { mReader = theReader; }
	inline void				SetWriter(DataWriter* theWriter) { mWriter = theWriter; }
	inline DataReader*		GetReader() { return mReader; }
	inline DataWriter*		GetWriter() { return mWriter; }
	void					SyncBytes(void* theData, uint32_t theDataLen);
	void					SyncUInt32(char& theNum);
	void					SyncUInt32(short& theNum);
	void					SyncUInt32(long& theNum);
	void					SyncUInt32(unsigned char& theNum);
	void					SyncUInt32(unsigned short& theNum);
	void					SyncUInt32(uint32_t& theNum);
	void					SyncUInt32(int& theNum);
	void					SyncUInt16(char& theNum);
	void					SyncUInt16(short& theNum);
	void					SyncUInt16(long& theNum);
	void					SyncUInt16(unsigned char& theNum);
	void					SyncUInt16(unsigned short& theNum);
	void					SyncUInt16(uint32_t& theNum);
	void					SyncUInt16(int& theNum);
	void					SyncUInt8(char& theChar);
	void					SyncUInt8(short& theChar);
	void					SyncUInt8(long& theChar);
	void					SyncUInt8(unsigned char& theChar);
	void					SyncUInt8(unsigned short& theChar);
	void					SyncUInt8(uint32_t& theChar);
	void					SyncUInt8(int& theChar);
	void					SyncBool(bool& theBool);
	void					SyncFloat(float& theFloat);
	void					SyncDouble(double& theDouble);
	void					SyncString(std::string& theStr);
	inline void				SyncPointer(void**) { /* 未找到 */ }
	inline void				RegisterPointer(void*) { /* 未找到 */ }
	inline void				SetVersion(int theVersion) { mVersion = theVersion; }
	inline int				GetVersion() const { return mVersion; }
};

#endif
